---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.CenterCurve
source: html/5d22cdfd-5eff-c54a-4560-c83fa56f47bc.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.CenterCurve Property

The curve lying in the geometrical center of the element.

## Syntax (C#)
```csharp
public Curve CenterCurve { get; }
```